#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-QAeGVi5c4Wp2wY2p

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_instance.composer_internal: Refreshing state... [id=i-01fb4a58c2d9fdd24]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-051f017fb12db6ba5]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3248351]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-b89308b8-c006-476d-9c54-514af2cfd8d6]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3730480781]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-9f77bfb5-f715-492a-aa7f-174947990c50]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_cloudinit_config.external_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "external_workers_cloud_init"  {
      ~ id            = "2119630125" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9RZ2ZLqyJm+J6LfIYeuibbjjEALUEXZ1WEEEqsEaAU8DiKVSpBQaikpxXZ8XmRu5nYebx5hQiCqqTqn227bERNdN1XK/Lf88l+zunFEcUQZ45TgZxDmhPoJTGk99I/Y/QNw4jxyYXp6qSpDRRKnptrraMtqpfhiLJxmfhw9A67Gflf5rsIw90TfVW6ye36WxJlPL7SQUoi8EEf0D2DjExzBEL9U/cinNbTZVn/iMlIYZRucMlKEYtePts/g0fHpHcHFZIqPtI5InLsMiqONv/2uovgh/sq47+9pKpU8w2n2XAGAAYUFzwAjnikWKwAAkGXeGubUi1P/jN11gE8X2uKHAdUs85g0g6DT6XREQT3DLndCvFR89jrzjtjpdLqdefe428jDIelvulHbR2RwCu1UElPD5MmkRQO9b3A4eXS7s/OB2y1bduTNyWyhJHiW+upRXZD+E7Kn7bomJ6LLntvyQT19CjZbr73JT+qy0R5+UmBrejIscdv01Fg+brRFv+kPKKrrcxI5kuyPEz1oED+JG/MVFWm47bxuA73T6p2909Zp5U2l7R+N4bFhi7tcV9j+Yn5WdwnenHw7/5QNtU8eb6bzYNwR83y4nDvpjnySPSuEk326PxlTPs+mdB8txZ3nzA6n6SNvz3YwGbv1tmfA15nEHeRTy5T5aIEas+2B3fpzp5X5jmycH1UDH22hOW8/vSbzqa0sxyjZrlKiw8FgvNIVj56nj4q7SqcT2VzEOtfBnVNj61GkplPRIE5T388ehfOZfRU1mUfdaWPKHpLm4fA68/YHPqKOkBiTGXUxHX2ymux8FiXR4qTr0Srhz/IBYZ5zFsfWY+S1SeRN0tV2hx9RPI9mHflYR0RoSfrotPXzGRIPnwLuaZmTpbIwX6FIg8NoEmi7XrIzFjxuKiOuFfces9EANep2MzhtJntXySzPfeW6i0HfsqbJOd46bLtpLX1WW8hJtNLqHLa23br2ybZOdLlZPrHpxpoitxPz/dUmGjXPS81cjEZtZRXA6HgUpEdz6gfSSG1n5o5n2XOrezqxw83w1XBGnNjcPG5cASItnTR6aGm68rDOiSfVbsnc7hGt/E5/Ohqrznkhs4ZAN09HFnPzlxcQwl2c/inFrgdpDcVh9b2/Y5dvNrn2xee7V58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxmhDMsEUu8Z1GmYXMN7XeSI9R6m2cUydM0Cz+CvpaFTXTSHk966O1WUofHyJCC4eWJZ3OSbfMNpcI3N46bpbJoQs66A2hyPntpcmy+5u1NlNtUl7cb+uGlioeW67cYT12Q3EDUcVmgJLdRyhbbjPLYwj584d/NReWfdlTTjZaKzdKJzXc10R4Yv9jRrZOrmajRnZVO77LG0G3Aj3dQkS1J7c3u1WLGyoJsjccUSy+ypc4VfnlVL7JtBk3P4FYtDpWn0Al7re6bDa6LLapptJhOHS0ZwsNoZgaxp5mE8J7LosqtXzbLUeUAGc0O2NFMWXPboK2wzWcluhrikpy5WO8dWBb3v7YyAe50v3JklWS3D0lbY5CTLUBewr06NRSK6h6TYa7zbC+SFYY00l7Ui29Rs05IlTZJZN1RO+k72LMFLjT7bxFbSmrOqaLJE0GR5pQd0bwckdkN12r3YPOqapiyteFc2JVm60NrtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxz/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+tecrJlNaSipskm0kRaQ3tzS5GsuZ8cfK8Vgqhsv+EhxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2Fe+RrAldrNWocV9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju90uqZ4znO59hC+9KzPk+4Idlyp0U9S72nBmDKfqWumonX5Z9jpq75/QlzsZSv2k6PKZkoVBcRjCyGWC+ZLE7Zv+pW5IygU+taNI65kmycPFSwkgc0OUOcRpUPbjd9j1htpLHVNUL/FlboDfpEtdTTL0t4NJam82HarG2tQmLx6lSfZcr78/We3tZDUYwnMcwUNW3GP9vg/5lsqvFmo0Dsm325M/B/HO/0v5AQmJD9hdu3EI/SgDL+DPoEoxDO+9pvofoOrlTs1J8eHj+hWbr7fATQOC4AVUv201ggxKaS3BRd9VWncV+Kvt+5fZ8QHpMI58mqJvQ/k9UIptcJ3l8hQWPgc2cQqGIdxiIBZqcAr8CHRsvfbG1YtR9gxuPhBedFzu+fJX3Y1RXsylF3HXtZpHQ1J5E9D1MAoA3uP0BAQWZBjFkZsBGLmAxFtAY5CdMhJvbyozTIELcRhHQGDv1griK+VPsjsF5AAihLMM7H1YzKCA5lGEyUUwxoB6GIS3k2cxwfd6imO5IIlTCvgnji+MKneLnzzDALpuWggnMYLEizN6tw+v2t3Qj54vKn4yzMKpvzkB6kEKDviHFIMopgBD6kfbgu9qFg7j9ATi6PLlRxmFEXqzrzuQuuMy7sFDEfhvqv3NjTfPirv7ETw2//3OsOJWmwCdEMHZ3TL1cATwESNQz7O0fjlS3fGjehKf49SJ6RoSnN6dQoqyPL1CmMYxvTw9ZKeM4hD4WfQDBZuckPf2ysOJVNp8YZl1jAGo31ueJRDhN8Of2K8Np374zu6DTz0/Aty/4khXbyx9w9+AAwYIRiDFEHkAuVHtp/nqpxhQp4b0u9CDJxdHv38GNgYHnxAAyQGeMrDFFEDQYAXg4RQDByNYeE68AYj4OKIA4ZRm72EqrhOkHiZr5EbAHhoDUNa3D0bcI7eBPsH3Dpr40fYfAOMXRRax0GgI90tpTGMUk2sSuNvIKKR5kecarPDhukCWERBf6loGPoNupxjwhvKw2zGkwkXKjJV6WVhHsH49L5PjpEhs4Ms/dKi3XPg3D/91cvy3C6kDM+/t0nUcueDCkxX+chNTe59Pf8gAjvZ+GkdFFgR7mPrQITgDMMXglhyxe3GN5zfWX51Ov5dUa6hNVUVSjZszz03JlN5V6Ncc5/hDOb5vO+p+keoZ55rqmduRmLKLKOUqkq53+tJL9X//+7/+BzwoU3VorIuB27jEZ7mgS5o17EpF9ipXLj4N6e2z1zGk23uIJunmxHh5+B08ZCB7zUCGI5cJcXbJAgxzMZzJUwIe3k4FmBsB48TuCVQfSsOqvy+lYuTF4OEqu/KxGO4xonFa/vqlFiOL8xThrLaL86KDcm9FmJ4SXJTh2/rtLPiISO7idR759FLkq6WOsnms/uWtP8j8KMhqcU4/yoSHbH15nzlAirw1ibfZTbwfJTktm4c31W+dAY7cJPYjWgi53XrB/bPd2E3sNo3zZB3B8KK/vPD1rW28UWU0xTB8I7s2Kutr1X07f/myXEOxi9EFoSyOqpVKmkcodK/vUMgLYxd8Ov4dQXslZR9Z9mMXw4BrsUGUABwVYQUYJooPZT2/wv4LT+i/5jH8yGQeJuTajf/ca/hdlii6BwbnMUj8BBdZtHL1o2+/vVW+B31M35V5MOzVKkNVNzpqV1oPey8Pv0NFADCT7JIenut1rtWu8c1GrfxdJ5DijNZDTCHjQgrrN1mM7/6+0NHJMhwWMBWNSnGJtYpsTiZvU8NL9eHztweJL8zD5ztjvlQLcbO08LQ4vxoe4cOd3EvsVXVMLx1N2RTctot8+fD5neovtYtIvUThA0OtcvuruOsMU+ZN1MM7Mb+N2y7BuQ53TgHQ263TGGgD9QqGhrd+RnH63i8u5bOgqXyInUvufDeDFa0Hc11i9pDkGPxnETbMLUtcM+rnX5ruvpQspRTfLej/xqz7BfwV7F4Bk4JqTb/w6TT1o20V/HgF5H6sXZe2rsuxtlZki8qN/Zcoq3+nMPBXcLmkNATM5u81oPKt0bv8PxtgGJjT+Lfkaz2ckPgEAnzKLkX6mrmzq5+Vm4WX3cZI0O1c2lJ/4yNIca3iwAy3GoBxAQP++Mc/gofPH17nv4AfwcPn+xeFL3ez6M+pCfDpMum90/X/5dffeCb6m65clsAC2Pee+9NG9duUV7d8A/Vr9K4MTIBPFwQ/CEYp/ScF367mLi6+Os1vz8UvPUJRHb7h6EV1yZM7ksr3wJj2pu9ntwhjt8jDKI72OC3qkX/p8HuqDooSm4JDMXMcMCAwj5BXqyBIL0FRvUO6HNe+3KNfVKkvVfDjj/cm/IYgvpXzPClxBWVPW+I7S3FSzDUfH6V+yECKw5jij2yX2M9iFOBiAP6Zbu4m7SqifMH800dYn58eWfYrMBnmu8r/BQAA//9Y6a1NjiEAAA==" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=external.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=172.31.64.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://logs.us-east-1.amazonaws.com/"
                      group_name = "staging_external"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_cloudinit_config.internal_workers_cloud_init will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "internal_workers_cloud_init"  {
      ~ id            = "3130564300" -> (known after apply)
      ~ rendered      = "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQEuLDPqdPLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUXLiOFUbbBKSNFKHb9aPsMHh2f3hGUJlN8pHVE4txlUBxt/O0PFcUP8VfG/XhPU6nkGU6z5woADCgseAYY8UyxWAEAgCzz1jCnXpz6Z+yuA3wqaYsfBlSzzGPSDIJOp9MRBfUMu9wJ8VLx2evMO2Kn0+l25t3jbiMPh6S/6UZtH5HBKbRTSUwNkyeTFg30vsHh5NHtzs4Hbrds2ZE3J7OFkuBZ6qtHdUH6T8ietuuanIgue27LB/X0KdhsvfYmP6nLRnv4SYGt6cmwxG3TU2P5uNEW/aY/oKiuz0nkSLI/TvSgQfwkbsxXVKThtvO6DfROq3f2TlunlTeVtn80hseGLe5yXWH7i/lZ3SV4c/Lt/FM21D55vJnOg3FHzPPhcu6kO/JJ9qwQTvbp/mRM+Tyb0n20FHeeMzucpo+8PdvBZOzW254BX2cSd5BPLVPmowVqzLYHduvPnVbmO7JxflQNfLSF5rz99JrMp7ayHKNku0qJDgeD8UpXPHqePiruKp1OZHMR61wHd06NrUeRmk5FgzhNfT97FM5n9lXUZB51p40pe0iah8PrzNsf+Ig6QmJMZtTFdPTJarLzWZREi5OuR6uEP8sHhHnOWRxbj5HXJpE3SVfbHX5E8TyadeRjHRGhJemj09bPZ0g8fAq4p2VOlsrCfIUiDQ6jSaDtesnOWPC4qYy4Vtx7zEYD1KjbzeC0mexdJbM895XrLgZ9y5om53jrsO2mtfRZbSEn0Uqrc9jaduvaJ9s60eVm+cSmG2uK3E7M91ebaNQ8LzVzMRq1lVUAo+NRkB7NqR9II7WdmTueZc+t7unEDjfDV8MZcWJz87hxBYi0dNLooaXpysM6J55UuyVzu0e08jv96WisOueFzBoC3TwdWczNX15ACHdx+qcUux6kNRSH1ff+jl2+2eTapc93Lz5PVr0hpxpSs1gbzkRuJ5NG0pIN0T8OjNZhGrQWT9GuvnrE8UydS3WFPYwbT80xiJ3chf47ZZVD6lO8LjLCNSwTSL1nUKdhcgnvdZEj1nuYZqVl6JIFnsFfr4ZOddEcTnrr7lRRhsbLk4Dg5ollcZNv8g2nwTU2j5ums2lCzLoCanM8empzbf7K3Z0qs6kuaTf2x00TCy3XbTeeuCa7gajhsEJLaKGWK7Qd57GFefzEuZuPyjvrrqQZLxOdpROd62qmOzJ8sadZI1M3V6M5K5taucfSbsCNdFOTLEntze3VYsXKgm6OxBVLLLOnzhV+eVYtsW8GTc7hVywOlabRC3it75kOr4kuq2m2mUwcLhnBwWpnBLKmmYfxnMiiy65eNctS5wEZzA3Z0kxZcNmjr7DNZCW7GeKSnrpY7RxbFfS+tzMC7nW+cGeWZLUMS1thk5MsQ13Avjo1FonoHpJir/FuL5AXhjXSXNaKbFOzTUuWNElm3VA56TvZswQvNfpsE1tJa86qoskSQZPllR7QvR2Q2A3Vabe0edQ1TVla8a5sSrJU0trtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxr/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+pecrJlNaSipskm0kRaQ3tzS5EsuZ8cfK8VgqhsvfkRxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2FY2sCW+Oeahx3JbGn2ljS1ro+WY+lpb7uaOoLTKNneMieM4xSTLMQRnCL0+c8YzDMKMM9twXhsclz7cd2u32lenZSfCj7VuZRNjEmV/m6KepdbTgzhlN1rXTUTv9a8jpq759XluVOhlI/KTp85srCoDgMYeQywXxJ4vZN/1I3JKWETu0o0nqmSfJw8XIFj7mhyRziNLj24ne49YbaSx1TVL9iy9zAvkmXuppk6G8Hk9TebDpUjbWpTV48SpPsuV7fJwgzrMsJXLMhsK1mo+1wyGXa52P6eG7ua+9PXns7ea1grMEQnuMIHrLiouv3jcq37PpqoUbjkHy7f/lzEO/8v1w/ICHxAbtrNw6hH2XgBfwZVCmG4b1bVf8NVL3cqRV3/XH9AuDXW+CmAUHwAqrfthpBBqW0luCiMbtadxH4D9v3L7PjA9JhHPk0Rd+G8kegFNvgMuzlKSwcE2ziFAxDuMVALNTgFPgR6Nh67Y2rF6PsGdwcJSx1lPdc/lV3Y5QXg2sp7rJW82hIKm8Cuh5GAcB7nJ6AwIIMozhyMwAjF5B4C2gMslNG4u1NZYYpcCEO4wgI7N1aQXyh/EV2p4AcQIRwloG9D4shFdA8ijApBWMMqIdBeDt5FhN8r6c4lguSOKWAf+L4wqjrbvGTZxhA100L4SRGkHhxRu/24UW7G/rRc6niF8MsnPqbE6AepOCAf0oxiGIKMKR+tC34LmbhME5PII7KLz/KKIzQm33dgdQdX5MDeCiyw5tqf3PjzbPi7n4Gj83/f2dYcatNgE6I4OxumXo4AviIEajnWVovj1R3/KiexOc4dWK6hgSnd6eQoixPLxCmcUzLt4nslFEcAj+LfqJgkxPy3l55OJGuNpcss44xAPV7y7MEIvxm+BP7teHUD9/ZffCp50eA+1cc6eKNV9/wN+CAAYIRSDFEHkBuVPtlAPslBtSpIf0u9ODJxdHvn4GNwcEnBEBygKcMbDEFEDRYAXg4xcDBCBaeE28AIj6OKEA4pdl7mIrrBKmHyRq5EbCHxgBcC+AHI+6R20Cf4HsHTfxo+0+A8V2RRSw0GsL9UhrTGMXkkgTuNjIKaV7kuQYrfLgukGUExGXxy8Bn0O0UE+BQHnY7hlS4yDVjpV4W1hGsX87L5DgpEhv48k8d6i0X/s3Df50c/19J6sDMe7t0HUcuKHmywl9uYmrv8+lPGcDR3k/jqMiCYA9THzoEZwCmGNySI3ZL13h+Y/2H0+mPkmoNtamqSKpxc+a5KZnSuzL+muP8Yzm+703qfpHqGeeS6pnbkZhrq3GVq0i63ulLL9X//s//+C/woEzVobEuJnKjjM/rgi5p1rArFdnrulL6NKS3z17HkG4PJpqkmxPj5eF38JCB7DUDGY5cJsRZmQUYpjScyVMCHt5OBZgbAePE7glUH66GVX9/lYqRF4OHi+zKx2K4x4jG6fXX91qMLM5ThLPaLs6LNsu9FWF6SnBRhm/rt7PgIyK5i9d55NOyyFevOjKc7n2Eq3956w8yPwqyWpzTjzLhIVuXDzgHSJG3JvE2u4n3oySn1+bhTfVbZ4AjN4n9iBZC3jdvHGYFzoFNVhCgw6Img1/32/i452uF9O+3bDfd2zTOk3UEw9LIq1esbw3ojSqjKYbhG9mlm1lfSvMbSNf36RqKXYxKGLM4qlYqaR6h0L28ZiEvjF3w6fh3RPaFlH1k2Y+tDgMuFQlRAnBUxB5gmCg+XIv+5W6+8xD/jzypH5nMw4Rc+vpfe1O/SyVFi8HgPAaJn+Ai1VYuzvbtF7zKj6CP6bteAAx7tcpQ1Y2O2pXWw97Lw+9QESXMJCtzyHO9zrXaNb7ZqF1/1wmkOKP1EFPIuJDC+k0W47u/L3R0sgyHBUxFN1NcYq0im5PJ2/zxUn34/O2R5Avz8PnOmC/VQtwsLdwxzi+GR/hwJ7cM0KqOadn2XDuH23aRVB8+v1P9pVaK1K8ofGCoVW5/FXedYcq8iXp4J+a3cdtXcC5jolMA9HbrNAbaQL2AoeGtn1GcvveLssYWNJUPsVMm2HfTWtGfMJclZg9JjsG/F2HD3FLJJe1+/t6c+OXKcpXiuwX935iav4C/gt0rYFJQrekln05TP9pWwc8XQO4H5PXV1vV1QK4V2aJyY/8eZfXvFAb+CspLSkPAbP5eAyrfGuKv/60DDANzGv+WfK2HExKfQIBPWVnJL5k7u/jZdbPwstusCbqdsnf1Nz6CFNcqDsxwqwEYFzDgj3/8I3j4/OGN/wv4GTx8vn+b+HI3sP6amgCfynHwna7/K7/+xmvT33TlawksgH3vub9sVL9NeXHLN1C/Ru/CwAT4VCL4QTBK6f9S8O1q7uLiq9P89ly87BGK6vANRy+qS57ckVR+BMa0N30/4EUYu0UeRnG0x2lRj/xyDOipOihKbAoOxWBywIDAPEJerYIgLYOieof0dab7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7g2vld8ZylOiuHn48vVTxlIcRhT/JGtjP0sRgEupuRf6eZu0i4irm+hf/oI6/PTI8t+BSbD/FD5nwAAAP//gR822tQhAAA=" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ part {
          ~ content      = <<-EOT
                #cloud-config
                
                users:
                  - name: ec2-user
                    ssh_authorized_keys:
                      - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                      - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
                
                write_files:
                  - path: /tmp/cloud_init_vars
                    content: |
                      OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                      COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                      OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                      COMPOSER_HOST=internal.staging.composer.osbuild.org
                      COMPOSER_ADDRESS=10.30.18.11
                      WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                      SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                      SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                      COMPOSER_DIR=/etc/osbuild-composer
                      SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
                  - path: /etc/osbuild-composer/osbuild-composer.toml
                    content: |
                      [koji]
                      allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                
                      [worker]
                      allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                      ca = "/etc/osbuild-composer/ca-crt.pem"
                  - path: /etc/monitrc
                    content: |
                      # Monit configuration for Image Builder in AWS.
                      # Docs: https://mmonit.com/monit/documentation/monit.html
                
                      # Check every 30 seconds and log to syslog.
                      set daemon 30
                      set log syslog
                
                      # Allow access via ssh tunnel to see the monit console.
                      set httpd port 2812 and
                          use address localhost
                          allow admin:monit
                
                      # Verify that we're not eating all the memory on the instance.
                      CHECK SYSTEM $HOST
                        if memory usage > 75%
                          for 5 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Ensure the root filesystem isn't full.
                      CHECK FILESYSTEM root PATH /
                        if space usage > 80%
                          for 5 times
                          within 15 cycles
                          then exec /usr/local/bin/pozorbot_alert
                
                      # Check to see if we can reach cdn.redhat.com.
                      # NOTE(mhayden): We will always get a 403 here because of client certs.
                      CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                        if failed
                          ping
                          then exec /usr/local/bin/pozorbot_alert
                        if failed
                          port 443
                          protocol https
                          status = 403
                          with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                          then exec /usr/local/bin/pozorbot_alert
                  - path: /usr/local/bin/pozorbot_alert
                    content: |
                      #!/bin/bash
                      # Send alerts to pozorbot.
                      # Monit's environment variables are documented here:
                      # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
                
                      QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                      MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                      RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                      echo $RESULT
                
                  - path: /etc/vector/vector.toml
                    content: |
                      [sources.journald]
                      type = "journald"
                      exclude_units = ["vector.service"]
                
                      [sinks.out]
                      type = "aws_cloudwatch_logs"
                      inputs = [ "journald" ]
                      endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                      group_name = "staging_internal"
                      stream_name = "worker_syslog"
                      encoding.codec = "json"
                
                runcmd:
                  - chmod +x /usr/local/bin/pozorbot_alert
                  - chmod 0700 /etc/monitrc
                  - systemctl enable --now monit vector
            EOT -> (known after apply)
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
      ~ part {
            # (2 unchanged attributes hidden)
        }
    }

  # data.template_file.external_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "external_workers_cloud_config"  {
      ~ id       = "aead6dee8589ba9c248d96da216e73a6d54bb65f200c3739bde35c317d575e15" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=external.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=172.31.64.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:service_keys-I2G3Wo
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-external-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://secretsmanager.us-east-1.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://logs.us-east-1.amazonaws.com/"
                  group_name = "staging_external"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "172.31.64.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # data.template_file.internal_workers_cloud_config will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "internal_workers_cloud_config"  {
      ~ id       = "2a904cfbb070bd7460dff0f55648390d237b8b543ba78663ea60c8a38f3519ee" -> (known after apply)
      ~ rendered = <<-EOT
            #cloud-config
            
            users:
              - name: ec2-user
                ssh_authorized_keys:
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCxjfFIIlGfCn9iclHymWrEBrTU2lL6tkSGT1ep7dCPzw1jY6WnhQlPXMpePriNxNXlG8cWO9/RFpBd0z9FwNy+kfgh9fuyNY49I+Ma6OyTVBg5hNoFxfRXG5iHtc/SQlnbEFiKpSk4lipo4QZtBtmgAqgkSA6Dzhygb6u5M9ixTIx4WBjuSM0GXQzNjpefyiWu+sIR+h2UrQkKABuuIYQbrjl+FhVmaLvrvyTO2usOtvnYBjhbPwyO72WPjapKd/9hTaqPE1wFy6UF2nXc4Pgw0giQb6sibFTz7NTexW35Q98qpQOWMYKcpgZrlSaHHKZSMhtzO7MdZrOLFUXoS1AeAy4ghtcNrOBTlb5SvP73zz0qBRF2cCO4O0wp5wwqPhvw2ntb3pTLPtdetJ+V50QPnpnXySSnZp2zFwce21bXx67nh9lnhLrZgje7coQnPAFx/cl36ESJygiuPcBw+k18YulYMXUqaBtkwJLkRjDpjTX2e5MJ16oD7sJHc4/W5kyfLvdMsVhdq1CXHGVVOpzogb095VYi0RXFpnZR/1eVgC/R+WVytYfY80rfVOcdAo2GZfnJ5zYRUXJJ9MZkanxx3E7UOikEJN9sUj200z6Cyy0IfIqTbJ1B5f7fd3acRrL4DcYUdFI/1ByNW6F1j7cZiAGOJKNbzXF0T3tf8x0e1Q== major@redhat.com"
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPB1jFl4p6FTBixHT6wOk6X8nj/Z7eoPNQE/M0wK485K obudai@redhat.com"
            
            write_files:
              - path: /tmp/cloud_init_vars
                content: |
                  OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
                  COMPOSER_COMMIT=7f5e36dd948150fac4b03636c6d39bb76e2e81df
                  OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
                  COMPOSER_HOST=internal.staging.composer.osbuild.org
                  COMPOSER_ADDRESS=10.30.18.11
                  WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
                  SUBSCRIPTION_MANAGER_COMMAND_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:subscription-manager-command-kQYlo9
                  SYSTEM_HOSTNAME_PREFIX=staging-internal-worker
                  COMPOSER_DIR=/etc/osbuild-composer
                  SECRETS_MANAGER_ENDPOINT_URL=https://vpce-0d13154306549b1cd-9zxr7z5v.secretsmanager.us-east-1.vpce.amazonaws.com/
              - path: /etc/osbuild-composer/osbuild-composer.toml
                content: |
                  [koji]
                  allowed_domains = [ "team.osbuild.org", "hub.brew.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
            
                  [worker]
                  allowed_domains = [ "team.osbuild.org", "worker.brew.osbuild.org" ]
                  ca = "/etc/osbuild-composer/ca-crt.pem"
              - path: /etc/monitrc
                content: |
                  # Monit configuration for Image Builder in AWS.
                  # Docs: https://mmonit.com/monit/documentation/monit.html
            
                  # Check every 30 seconds and log to syslog.
                  set daemon 30
                  set log syslog
            
                  # Allow access via ssh tunnel to see the monit console.
                  set httpd port 2812 and
                      use address localhost
                      allow admin:monit
            
                  # Verify that we're not eating all the memory on the instance.
                  CHECK SYSTEM $HOST
                    if memory usage > 75%
                      for 5 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Ensure the root filesystem isn't full.
                  CHECK FILESYSTEM root PATH /
                    if space usage > 80%
                      for 5 times
                      within 15 cycles
                      then exec /usr/local/bin/pozorbot_alert
            
                  # Check to see if we can reach cdn.redhat.com.
                  # NOTE(mhayden): We will always get a 403 here because of client certs.
                  CHECK HOST rhel_cdn WITH ADDRESS cdn.redhat.com
                    if failed
                      ping
                      then exec /usr/local/bin/pozorbot_alert
                    if failed
                      port 443
                      protocol https
                      status = 403
                      with ssl options { CACERTIFICATEFILE: /etc/rhsm/ca/redhat-uep.pem }
                      then exec /usr/local/bin/pozorbot_alert
              - path: /usr/local/bin/pozorbot_alert
                content: |
                  #!/bin/bash
                  # Send alerts to pozorbot.
                  # Monit's environment variables are documented here:
                  # https://mmonit.com/monit/documentation/monit.html#ENVIRONMENT
            
                  QUEUE_URL=https://queue.amazonaws.com/933752197999/image-builder-pozorbot-staging
                  MESSAGE="🚨 $MONIT_EVENT for $MONIT_SERVICE on $MONIT_HOST at $MONIT_DATE"
                  RESULT=$(aws sqs send-message --queue-url $QUEUE_URL --message-body "$MESSAGE")
                  echo $RESULT
            
              - path: /etc/vector/vector.toml
                content: |
                  [sources.journald]
                  type = "journald"
                  exclude_units = ["vector.service"]
            
                  [sinks.out]
                  type = "aws_cloudwatch_logs"
                  inputs = [ "journald" ]
                  endpoint = "https://vpce-01e031ba5033ab0c5-eqvgoxv2.logs.us-east-1.vpce.amazonaws.com/"
                  group_name = "staging_internal"
                  stream_name = "worker_syslog"
                  encoding.codec = "json"
            
            runcmd:
              - chmod +x /usr/local/bin/pozorbot_alert
              - chmod 0700 /etc/monitrc
              - systemctl enable --now monit vector
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"                = "10.30.18.11" -> (known after apply)
            # (10 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_external must be replaced
-/+ resource "aws_instance" "composer_external" {
      ~ ami                          = "ami-0a54ea24893e357ca" -> "ami-03f65a3b08539fe78" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-051f017fb12db6ba5" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1f" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-051f017fb12db6ba5" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-02f250427cdd85dc7" -> (known after apply)
      ~ private_dns                  = "ip-172-31-64-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.64.11" -> (known after apply)
      ~ public_dns                   = "ec2-34-234-177-181.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "34.234.177.181" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "external_composer_staging",
        ] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-0c016a02" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 External Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-0be4cfbfac3cc0022",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 External Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0daeecfc25da04a05" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0804a19fb91204ab4" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0a54ea24893e357ca" -> "ami-03f65a3b08539fe78" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-01fb4a58c2d9fdd24" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-01fb4a58c2d9fdd24" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-07088640399f60f49" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-11.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.11" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-084607083aaa39727",
          - "sg-0eb65fd8f2c17dba5",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - tags                  = {
              - "AppCode"      = "IMGB-001"
              - "Name"         = "🏗 Internal Composer (staging)"
              - "ServiceOwner" = "Image Builder"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-058d1cec56397f102" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-02ab51aaf5960d7db" -> (known after apply)
          ~ volume_size           = 25 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 10 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ image_id                = "ami-0a54ea24893e357ca" -> "ami-03f65a3b08539fe78"
      ~ latest_version          = 10 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9RZ2ZLqyJm+J6LfIYeuibbjjEALUEXZ1WEEEqsEaAU8DiKVSpBQaikpxXZ8XmRu5nYebx5hQiCqqTqn227bERNdN1XK/Lf88l+zunFEcUQZ45TgZxDmhPoJTGk99I/Y/QNw4jxyYXp6qSpDRRKnptrraMtqpfhiLJxmfhw9A67Gflf5rsIw90TfVW6ye36WxJlPL7SQUoi8EEf0D2DjExzBEL9U/cinNbTZVn/iMlIYZRucMlKEYtePts/g0fHpHcHFZIqPtI5InLsMiqONv/2uovgh/sq47+9pKpU8w2n2XAGAAYUFzwAjnikWKwAAkGXeGubUi1P/jN11gE8X2uKHAdUs85g0g6DT6XREQT3DLndCvFR89jrzjtjpdLqdefe428jDIelvulHbR2RwCu1UElPD5MmkRQO9b3A4eXS7s/OB2y1bduTNyWyhJHiW+upRXZD+E7Kn7bomJ6LLntvyQT19CjZbr73JT+qy0R5+UmBrejIscdv01Fg+brRFv+kPKKrrcxI5kuyPEz1oED+JG/MVFWm47bxuA73T6p2909Zp5U2l7R+N4bFhi7tcV9j+Yn5WdwnenHw7/5QNtU8eb6bzYNwR83y4nDvpjnySPSuEk326PxlTPs+mdB8txZ3nzA6n6SNvz3YwGbv1tmfA15nEHeRTy5T5aIEas+2B3fpzp5X5jmycH1UDH22hOW8/vSbzqa0sxyjZrlKiw8FgvNIVj56nj4q7SqcT2VzEOtfBnVNj61GkplPRIE5T388ehfOZfRU1mUfdaWPKHpLm4fA68/YHPqKOkBiTGXUxHX2ymux8FiXR4qTr0Srhz/IBYZ5zFsfWY+S1SeRN0tV2hx9RPI9mHflYR0RoSfrotPXzGRIPnwLuaZmTpbIwX6FIg8NoEmi7XrIzFjxuKiOuFfces9EANep2MzhtJntXySzPfeW6i0HfsqbJOd46bLtpLX1WW8hJtNLqHLa23br2ybZOdLlZPrHpxpoitxPz/dUmGjXPS81cjEZtZRXA6HgUpEdz6gfSSG1n5o5n2XOrezqxw83w1XBGnNjcPG5cASItnTR6aGm68rDOiSfVbsnc7hGt/E5/Ohqrznkhs4ZAN09HFnPzlxcQwl2c/inFrgdpDcVh9b2/Y5dvNrn2xee7V58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxmhDMsEUu8Z1GmYXMN7XeSI9R6m2cUydM0Cz+CvpaFTXTSHk966O1WUofHyJCC4eWJZ3OSbfMNpcI3N46bpbJoQs66A2hyPntpcmy+5u1NlNtUl7cb+uGlioeW67cYT12Q3EDUcVmgJLdRyhbbjPLYwj584d/NReWfdlTTjZaKzdKJzXc10R4Yv9jRrZOrmajRnZVO77LG0G3Aj3dQkS1J7c3u1WLGyoJsjccUSy+ypc4VfnlVL7JtBk3P4FYtDpWn0Al7re6bDa6LLapptJhOHS0ZwsNoZgaxp5mE8J7LosqtXzbLUeUAGc0O2NFMWXPboK2wzWcluhrikpy5WO8dWBb3v7YyAe50v3JklWS3D0lbY5CTLUBewr06NRSK6h6TYa7zbC+SFYY00l7Ui29Rs05IlTZJZN1RO+k72LMFLjT7bxFbSmrOqaLJE0GR5pQd0bwckdkN12r3YPOqapiyteFc2JVm60NrtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxz/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+tecrJlNaSipskm0kRaQ3tzS5GsuZ8cfK8Vgqhsv+EhxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2Fe+RrAldrNWocV9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju90uqZ4znO59hC+9KzPk+4Idlyp0U9S72nBmDKfqWumonX5Z9jpq75/QlzsZSv2k6PKZkoVBcRjCyGWC+ZLE7Zv+pW5IygU+taNI65kmycPFSwkgc0OUOcRpUPbjd9j1htpLHVNUL/FlboDfpEtdTTL0t4NJam82HarG2tQmLx6lSfZcr78/We3tZDUYwnMcwUNW3GP9vg/5lsqvFmo0Dsm325M/B/HO/0v5AQmJD9hdu3EI/SgDL+DPoEoxDO+9pvofoOrlTs1J8eHj+hWbr7fATQOC4AVUv201ggxKaS3BRd9VWncV+Kvt+5fZ8QHpMI58mqJvQ/k9UIptcJ3l8hQWPgc2cQqGIdxiIBZqcAr8CHRsvfbG1YtR9gxuPhBedFzu+fJX3Y1RXsylF3HXtZpHQ1J5E9D1MAoA3uP0BAQWZBjFkZsBGLmAxFtAY5CdMhJvbyozTIELcRhHQGDv1griK+VPsjsF5AAihLMM7H1YzKCA5lGEyUUwxoB6GIS3k2cxwfd6imO5IIlTCvgnji+MKneLnzzDALpuWggnMYLEizN6tw+v2t3Qj54vKn4yzMKpvzkB6kEKDviHFIMopgBD6kfbgu9qFg7j9ATi6PLlRxmFEXqzrzuQuuMy7sFDEfhvqv3NjTfPirv7ETw2//3OsOJWmwCdEMHZ3TL1cATwESNQz7O0fjlS3fGjehKf49SJ6RoSnN6dQoqyPL1CmMYxvTw9ZKeM4hD4WfQDBZuckPf2ysOJVNp8YZl1jAGo31ueJRDhN8Of2K8Np374zu6DTz0/Aty/4khXbyx9w9+AAwYIRiDFEHkAuVHtp/nqpxhQp4b0u9CDJxdHv38GNgYHnxAAyQGeMrDFFEDQYAXg4RQDByNYeE68AYj4OKIA4ZRm72EqrhOkHiZr5EbAHhoDUNa3D0bcI7eBPsH3Dpr40fYfAOMXRRax0GgI90tpTGMUk2sSuNvIKKR5kecarPDhukCWERBf6loGPoNupxjwhvKw2zGkwkXKjJV6WVhHsH49L5PjpEhs4Ms/dKi3XPg3D/91cvy3C6kDM+/t0nUcueDCkxX+chNTe59Pf8gAjvZ+GkdFFgR7mPrQITgDMMXglhyxe3GN5zfWX51Ov5dUa6hNVUVSjZszz03JlN5V6Ncc5/hDOb5vO+p+keoZ55rqmduRmLKLKOUqkq53+tJL9X//+7/+BzwoU3VorIuB27jEZ7mgS5o17EpF9ipXLj4N6e2z1zGk23uIJunmxHh5+B08ZCB7zUCGI5cJcXbJAgxzMZzJUwIe3k4FmBsB48TuCVQfSsOqvy+lYuTF4OEqu/KxGO4xonFa/vqlFiOL8xThrLaL86KDcm9FmJ4SXJTh2/rtLPiISO7idR759FLkq6WOsnms/uWtP8j8KMhqcU4/yoSHbH15nzlAirw1ibfZTbwfJTktm4c31W+dAY7cJPYjWgi53XrB/bPd2E3sNo3zZB3B8KK/vPD1rW28UWU0xTB8I7s2Kutr1X07f/myXEOxi9EFoSyOqpVKmkcodK/vUMgLYxd8Ov4dQXslZR9Z9mMXw4BrsUGUABwVYQUYJooPZT2/wv4LT+i/5jH8yGQeJuTajf/ca/hdlii6BwbnMUj8BBdZtHL1o2+/vVW+B31M35V5MOzVKkNVNzpqV1oPey8Pv0NFADCT7JIenut1rtWu8c1GrfxdJ5DijNZDTCHjQgrrN1mM7/6+0NHJMhwWMBWNSnGJtYpsTiZvU8NL9eHztweJL8zD5ztjvlQLcbO08LQ4vxoe4cOd3EvsVXVMLx1N2RTctot8+fD5neovtYtIvUThA0OtcvuruOsMU+ZN1MM7Mb+N2y7BuQ53TgHQ263TGGgD9QqGhrd+RnH63i8u5bOgqXyInUvufDeDFa0Hc11i9pDkGPxnETbMLUtcM+rnX5ruvpQspRTfLej/xqz7BfwV7F4Bk4JqTb/w6TT1o20V/HgF5H6sXZe2rsuxtlZki8qN/Zcoq3+nMPBXcLmkNATM5u81oPKt0bv8PxtgGJjT+Lfkaz2ckPgEAnzKLkX6mrmzq5+Vm4WX3cZI0O1c2lJ/4yNIca3iwAy3GoBxAQP++Mc/gofPH17nv4AfwcPn+xeFL3ez6M+pCfDpMum90/X/5dffeCb6m65clsAC2Pee+9NG9duUV7d8A/Vr9K4MTIBPFwQ/CEYp/ScF367mLi6+Os1vz8UvPUJRHb7h6EV1yZM7ksr3wJj2pu9ntwhjt8jDKI72OC3qkX/p8HuqDooSm4JDMXMcMCAwj5BXqyBIL0FRvUO6HNe+3KNfVKkvVfDjj/cm/IYgvpXzPClxBWVPW+I7S3FSzDUfH6V+yECKw5jij2yX2M9iFOBiAP6Zbu4m7SqifMH800dYn58eWfYrMBnmu8r/BQAA//9Y6a1NjiEAAA==" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 8 -> (known after apply)
        id                      = "lt-0a23e96f3feb1649c"
      ~ image_id                = "ami-0a54ea24893e357ca" -> "ami-03f65a3b08539fe78"
      ~ latest_version          = 8 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQEuLDPqdPLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUXLiOFUbbBKSNFKHb9aPsMHh2f3hGUJlN8pHVE4txlUBxt/O0PFcUP8VfG/XhPU6nkGU6z5woADCgseAYY8UyxWAEAgCzz1jCnXpz6Z+yuA3wqaYsfBlSzzGPSDIJOp9MRBfUMu9wJ8VLx2evMO2Kn0+l25t3jbiMPh6S/6UZtH5HBKbRTSUwNkyeTFg30vsHh5NHtzs4Hbrds2ZE3J7OFkuBZ6qtHdUH6T8ietuuanIgue27LB/X0KdhsvfYmP6nLRnv4SYGt6cmwxG3TU2P5uNEW/aY/oKiuz0nkSLI/TvSgQfwkbsxXVKThtvO6DfROq3f2TlunlTeVtn80hseGLe5yXWH7i/lZ3SV4c/Lt/FM21D55vJnOg3FHzPPhcu6kO/JJ9qwQTvbp/mRM+Tyb0n20FHeeMzucpo+8PdvBZOzW254BX2cSd5BPLVPmowVqzLYHduvPnVbmO7JxflQNfLSF5rz99JrMp7ayHKNku0qJDgeD8UpXPHqePiruKp1OZHMR61wHd06NrUeRmk5FgzhNfT97FM5n9lXUZB51p40pe0iah8PrzNsf+Ig6QmJMZtTFdPTJarLzWZREi5OuR6uEP8sHhHnOWRxbj5HXJpE3SVfbHX5E8TyadeRjHRGhJemj09bPZ0g8fAq4p2VOlsrCfIUiDQ6jSaDtesnOWPC4qYy4Vtx7zEYD1KjbzeC0mexdJbM895XrLgZ9y5om53jrsO2mtfRZbSEn0Uqrc9jaduvaJ9s60eVm+cSmG2uK3E7M91ebaNQ8LzVzMRq1lVUAo+NRkB7NqR9II7WdmTueZc+t7unEDjfDV8MZcWJz87hxBYi0dNLooaXpysM6J55UuyVzu0e08jv96WisOueFzBoC3TwdWczNX15ACHdx+qcUux6kNRSH1ff+jl2+2eTapc93Lz5PVr0hpxpSs1gbzkRuJ5NG0pIN0T8OjNZhGrQWT9GuvnrE8UydS3WFPYwbT80xiJ3chf47ZZVD6lO8LjLCNSwTSL1nUKdhcgnvdZEj1nuYZqVl6JIFnsFfr4ZOddEcTnrr7lRRhsbLk4Dg5ollcZNv8g2nwTU2j5ums2lCzLoCanM8empzbf7K3Z0qs6kuaTf2x00TCy3XbTeeuCa7gajhsEJLaKGWK7Qd57GFefzEuZuPyjvrrqQZLxOdpROd62qmOzJ8sadZI1M3V6M5K5taucfSbsCNdFOTLEntze3VYsXKgm6OxBVLLLOnzhV+eVYtsW8GTc7hVywOlabRC3it75kOr4kuq2m2mUwcLhnBwWpnBLKmmYfxnMiiy65eNctS5wEZzA3Z0kxZcNmjr7DNZCW7GeKSnrpY7RxbFfS+tzMC7nW+cGeWZLUMS1thk5MsQ13Avjo1FonoHpJir/FuL5AXhjXSXNaKbFOzTUuWNElm3VA56TvZswQvNfpsE1tJa86qoskSQZPllR7QvR2Q2A3Vabe0edQ1TVla8a5sSrJU0trtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxr/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+pecrJlNaSipskm0kRaQ3tzS5EsuZ8cfK8VgqhsvfkRxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2FY2sCW+Oeahx3JbGn2ljS1ro+WY+lpb7uaOoLTKNneMieM4xSTLMQRnCL0+c8YzDMKMM9twXhsclz7cd2u32lenZSfCj7VuZRNjEmV/m6KepdbTgzhlN1rXTUTv9a8jpq759XluVOhlI/KTp85srCoDgMYeQywXxJ4vZN/1I3JKWETu0o0nqmSfJw8XIFj7mhyRziNLj24ne49YbaSx1TVL9iy9zAvkmXuppk6G8Hk9TebDpUjbWpTV48SpPsuV7fJwgzrMsJXLMhsK1mo+1wyGXa52P6eG7ua+9PXns7ea1grMEQnuMIHrLiouv3jcq37PpqoUbjkHy7f/lzEO/8v1w/ICHxAbtrNw6hH2XgBfwZVCmG4b1bVf8NVL3cqRV3/XH9AuDXW+CmAUHwAqrfthpBBqW0luCiMbtadxH4D9v3L7PjA9JhHPk0Rd+G8kegFNvgMuzlKSwcE2ziFAxDuMVALNTgFPgR6Nh67Y2rF6PsGdwcJSx1lPdc/lV3Y5QXg2sp7rJW82hIKm8Cuh5GAcB7nJ6AwIIMozhyMwAjF5B4C2gMslNG4u1NZYYpcCEO4wgI7N1aQXyh/EV2p4AcQIRwloG9D4shFdA8ijApBWMMqIdBeDt5FhN8r6c4lguSOKWAf+L4wqjrbvGTZxhA100L4SRGkHhxRu/24UW7G/rRc6niF8MsnPqbE6AepOCAf0oxiGIKMKR+tC34LmbhME5PII7KLz/KKIzQm33dgdQdX5MDeCiyw5tqf3PjzbPi7n4Gj83/f2dYcatNgE6I4OxumXo4AviIEajnWVovj1R3/KiexOc4dWK6hgSnd6eQoixPLxCmcUzLt4nslFEcAj+LfqJgkxPy3l55OJGuNpcss44xAPV7y7MEIvxm+BP7teHUD9/ZffCp50eA+1cc6eKNV9/wN+CAAYIRSDFEHkBuVPtlAPslBtSpIf0u9ODJxdHvn4GNwcEnBEBygKcMbDEFEDRYAXg4xcDBCBaeE28AIj6OKEA4pdl7mIrrBKmHyRq5EbCHxgBcC+AHI+6R20Cf4HsHTfxo+0+A8V2RRSw0GsL9UhrTGMXkkgTuNjIKaV7kuQYrfLgukGUExGXxy8Bn0O0UE+BQHnY7hlS4yDVjpV4W1hGsX87L5DgpEhv48k8d6i0X/s3Df50c/19J6sDMe7t0HUcuKHmywl9uYmrv8+lPGcDR3k/jqMiCYA9THzoEZwCmGNySI3ZL13h+Y/2H0+mPkmoNtamqSKpxc+a5KZnSuzL+muP8Yzm+703qfpHqGeeS6pnbkZhrq3GVq0i63ulLL9X//s//+C/woEzVobEuJnKjjM/rgi5p1rArFdnrulL6NKS3z17HkG4PJpqkmxPj5eF38JCB7DUDGY5cJsRZmQUYpjScyVMCHt5OBZgbAePE7glUH66GVX9/lYqRF4OHi+zKx2K4x4jG6fXX91qMLM5ThLPaLs6LNsu9FWF6SnBRhm/rt7PgIyK5i9d55NOyyFevOjKc7n2Eq3956w8yPwqyWpzTjzLhIVuXDzgHSJG3JvE2u4n3oySn1+bhTfVbZ4AjN4n9iBZC3jdvHGYFzoFNVhCgw6Img1/32/i452uF9O+3bDfd2zTOk3UEw9LIq1esbw3ojSqjKYbhG9mlm1lfSvMbSNf36RqKXYxKGLM4qlYqaR6h0L28ZiEvjF3w6fh3RPaFlH1k2Y+tDgMuFQlRAnBUxB5gmCg+XIv+5W6+8xD/jzypH5nMw4Rc+vpfe1O/SyVFi8HgPAaJn+Ai1VYuzvbtF7zKj6CP6bteAAx7tcpQ1Y2O2pXWw97Lw+9QESXMJCtzyHO9zrXaNb7ZqF1/1wmkOKP1EFPIuJDC+k0W47u/L3R0sgyHBUxFN1NcYq0im5PJ2/zxUn34/O2R5Avz8PnOmC/VQtwsLdwxzi+GR/hwJ7cM0KqOadn2XDuH23aRVB8+v1P9pVaK1K8ofGCoVW5/FXedYcq8iXp4J+a3cdtXcC5jolMA9HbrNAbaQL2AoeGtn1GcvveLssYWNJUPsVMm2HfTWtGfMJclZg9JjsG/F2HD3FLJJe1+/t6c+OXKcpXiuwX935iav4C/gt0rYFJQrekln05TP9pWwc8XQO4H5PXV1vV1QK4V2aJyY/8eZfXvFAb+CspLSkPAbP5eAyrfGuKv/60DDANzGv+WfK2HExKfQIBPWVnJL5k7u/jZdbPwstusCbqdsnf1Nz6CFNcqDsxwqwEYFzDgj3/8I3j4/OGN/wv4GTx8vn+b+HI3sP6amgCfynHwna7/K7/+xmvT33TlawksgH3vub9sVL9NeXHLN1C/Ru/CwAT4VCL4QTBK6f9S8O1q7uLiq9P89ly87BGK6vANRy+qS57ckVR+BMa0N30/4EUYu0UeRnG0x2lRj/xyDOipOihKbAoOxWBywIDAPEJerYIgLYOieof0dab7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7g2vld8ZylOiuHn48vVTxlIcRhT/JGtjP0sRgEupuRf6eZu0i4irm+hf/oI6/PTI8t+BSbD/FD5nwAAAP//gR822tQhAAA=" -> (known after apply)
        # (7 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_security_group.external_vpc_endpoints will be destroyed
  - resource "aws_security_group" "external_vpc_endpoints" {
      - arn                    = "arn:aws:ec2:us-east-1:933752197999:security-group/sg-0be443e4c92c98b1c" -> null
      - description            = "Allow ingress traffic" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0be443e4c92c98b1c" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "external_vpc_endpoints_staging" -> null
      - owner_id               = "933752197999" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "external_vpc_endpoints_staging"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_id                 = "vpc-78468405" -> null
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210201142208891100000002" -> (known after apply)
      ~ id                                  = "sfr-9f77bfb5-f715-492a-aa7f-174947990c50" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "10" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-20210201131751442100000003" -> (known after apply)
      ~ id                                  = "sfr-b89308b8-c006-476d-9c54-514af2cfd8d6" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0a23e96f3feb1649c" -> null
              - version = "8" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0a23e96f3feb1649c"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_external must be replaced
-/+ resource "aws_volume_attachment" "composer_external" {
      ~ id          = "vai-3730480781" -> (known after apply)
      ~ instance_id = "i-051f017fb12db6ba5" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-3248351" -> (known after apply)
      ~ instance_id = "i-01fb4a58c2d9fdd24" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.external_vpc_cloudwatch_logs will be destroyed
  - resource "aws_vpc_endpoint" "external_vpc_cloudwatch_logs" {
      - arn                   = "arn:aws:ec2:us-east-1:933752197999:vpc-endpoint/vpce-0ffb71834c608a4e5" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1f.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1b.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1d.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1e.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1c.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-0ffb71834c608a4e5-v9hel2o2-us-east-1a.logs.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
        ] -> null
      - id                    = "vpce-0ffb71834c608a4e5" -> null
      - network_interface_ids = [
          - "eni-01da4051607e5c8e9",
          - "eni-042a7ba3f755033e8",
          - "eni-045c0f895e89e8740",
          - "eni-0888c029ba7f4ce66",
          - "eni-0a71c252eee23ffab",
          - "eni-0d66caf489d040754",
        ] -> null
      - owner_id              = "933752197999" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-0be443e4c92c98b1c",
        ] -> null
      - service_name          = "com.amazonaws.us-east-1.logs" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-0c016a02",
          - "subnet-21fe3b10",
          - "subnet-4920962f",
          - "subnet-8ba519aa",
          - "subnet-9d4a0bd0",
          - "subnet-ddc07282",
        ] -> null
      - tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "📜 CloudWatch Logs VPC endpoint (external)"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-78468405" -> null
    }

  # aws_vpc_endpoint.external_vpc_secretsmanager will be destroyed
  - resource "aws_vpc_endpoint" "external_vpc_secretsmanager" {
      - arn                   = "arn:aws:ec2:us-east-1:933752197999:vpc-endpoint/vpce-013676c2939c3d681" -> null
      - cidr_blocks           = [] -> null
      - dns_entry             = [
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1b.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1a.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1f.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1e.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1c.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
          - {
              - dns_name       = "vpce-013676c2939c3d681-tky2t1gz-us-east-1d.secretsmanager.us-east-1.vpce.amazonaws.com"
              - hosted_zone_id = "Z7HUB22UULQXV"
            },
        ] -> null
      - id                    = "vpce-013676c2939c3d681" -> null
      - network_interface_ids = [
          - "eni-009e1adc87840a7c1",
          - "eni-02aa9ab26db556627",
          - "eni-054c2e816014f7876",
          - "eni-0b383c28c2b31ca0c",
          - "eni-0ba894f020eea29b3",
          - "eni-0bfef28f57ed073f7",
        ] -> null
      - owner_id              = "933752197999" -> null
      - policy                = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "*"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "*"
                    },
                ]
            }
        ) -> null
      - private_dns_enabled   = false -> null
      - requester_managed     = false -> null
      - route_table_ids       = [] -> null
      - security_group_ids    = [
          - "sg-0be443e4c92c98b1c",
        ] -> null
      - service_name          = "com.amazonaws.us-east-1.secretsmanager" -> null
      - state                 = "available" -> null
      - subnet_ids            = [
          - "subnet-0c016a02",
          - "subnet-21fe3b10",
          - "subnet-4920962f",
          - "subnet-8ba519aa",
          - "subnet-9d4a0bd0",
          - "subnet-ddc07282",
        ] -> null
      - tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "🤫 Secrets Manager VPC endpoint (external)"
          - "ServiceOwner" = "Image Builder"
        } -> null
      - vpc_endpoint_type     = "Interface" -> null
      - vpc_id                = "vpc-78468405" -> null
    }

Plan: 6 to add, 2 to change, 9 to destroy.

Changes to Outputs:
  ~ rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20210127220723 (ami-0a54ea24893e357ca)" -> "RHEL 8 pre-built: imagebuilder-service-image-20210208132209 (ami-03f65a3b08539fe78)"
```

</details>

*Pusher: @major, Action: `pull_request`*